*** Microblogging: Try Two
Now, let's go ahead and try to write a version of the server that can handle taking in input as well. We'll also, in this case, be using hogan.js in order to do some templating and making this a little bit easier. Note that we'll be using straight-up hogan for templating and /not/ using it as middle-ware because I want to demystify what's happening with these template engines a little bit.

So first before you actually try running anything you'll need to type this in your command line

#+BEGIN_SRC sh :exports code
  npm install hogan.js
#+END_SRC

#+RESULTS:
| hogan.js@3.0.2 | node_modules/hogan.js |                |
| ├──            | mkdirp@0.3.0          |                |
| └──            | nopt@1.0.10           | (abbrev@1.0.5) |

Okay, so first we'll make a hogan template file for displaying posts that will also have a form that will let us add a post and then we'll handle that as well.
#+NAME: posts-1.html
#+BEGIN_SRC html :exports code :tangle posts-1.html
  <!DOCTYPE html>
  <html lang="en">
  <body>
    <h1>Make Post</h1>
    <form action="/addpost" method="post">
      <input name="post" placeholder="Say something" type="text" maxlength="140">
      <button type="submit">Post</button>
    </form>
    <h1>Posts</h1>
    <ul>
      {{#posts}}
      <li>{{.}}</li>
      {{/posts}}
    </ul>
  </body>
  </html>
#+END_SRC

and now we include it in our main code below

#+NAME: MicroBlog-2.js
#+BEGIN_SRC js :exports code :tangle MicroBlog-2.js
  var http = require('http');
  var url = require('url');
  var fs = require('fs');
  var hogan = require('hogan.js');

  var templateFile = fs.readFileSync('posts-1.html').toString();
  var template = hogan.compile(templateFile);

  var posts = [];

  function extractValue(str){
      // this function is for splitting the data returned by a form
      // we need to split it across the = sign
      var index = str.indexOf('=');
      return str.slice(index+1);
  }

  http.createServer(function (req,res) {
      var method = req.method;
      var urlObj = url.parse(req.url,true);
      var urlPath = urlObj.path.slice(1).split('/')[0];

      if(method === "GET" && urlPath===""){
          var html = template.render({posts : posts});
          res.writeHead(200,{"Content-Type" : "text/html"});
          res.end(html);
      }
      else if (method === "POST" && urlPath ==="addpost") {
          var tempPost = "";
          req.on("data", function (chunk) {
              tempPost = tempPost + chunk.toString();
          });
          req.on("end", function () {
              var html ='<a href="/">Go Back</a>'
              posts.push(extractValue(tempPost));
              res.writeHead(200,{"Content-Type" : "text/html"});
              res.end(html);
          });
      }
  }).listen(3000, function () {
      console.log("Listening on port 3000\n")
  });
#+END_SRC

This code is a lot longer than our first attempt. Let's try to understand the logic of what's happening here. First off, we've got the dispatch over method and url path that we looked at earlier. So hopefully that's not too weird at this point. Now if we're just loading the main page, then we take the template file we loaded with the ~fs.readFileSync~ and compiled with ~hogan.compile~ and we then /render/ it by passing in the object ~{ posts : posts}~ which turns it into a /string/ that contains the HTML we'll send back to the client. So what's ~{ posts : posts}~ mean? Well, we're telling the template renderer that where we used the variables ~posts~ in the template it should have the values of the variables ~posts~ in our code. Now, these variables don't have to be named the same thing at all but I find it easier to remember if there's a consistency between the names of the variables-in-the-template and the variables-in-the-code. In our template we have a form that will pass along 

Let's also talk about what's happening with the /other/ request that's being handled which is a POST request to the url path "addpost". Since we're using straight-up node without any extra libraries other than templating, that means our data retrieval is inherently asynchronous. As such in order to get data out of the request we need to write our data handlers for the ~data~ and ~end~ events. The ~data~ request just does what we've seen earlier: we push all of the data into some variable we've set aside for this purpose. When we're done retrieving data, i.e. when the ~end~ event happens that's when we actually do something. So what do we do? Well, we take the data returned by the form on the main page, split it into the actual /value/ we want with our simple ~extractValue~ function. We need to do this because the form returns data in the form of "post=blahblahblah". Why? Well, it's because we had an input with the /name/ attribute set to /post/. This is a good of time as any to point out that the form element of the template was set to have an /action/ of "\/addpost" because that's the URL path of the request we'll handle and the /method/ set to POST.

Hopefully this helps explain what's happening in this code so far. To summarize we've covered so far:
  + How to make simple http servers
  + How to respond to different urls and http method types
  + How to use simple templates and compile them with Hogan.js
  + How to use forms to send data from the client to the server
*** Making Data Persistent with Orchestrate
Files are useful for persistence in a pinch, but there's a number of disadvantages. First off, if the format of your data changes at all then you'll need to rewrite your custom code for storing data in a file and retrieving it. Second, if we want to actually be able to usefully /search/ through our data, which our current naive use of files cannot do, then we'll have to add a good bit of code in order to handle this. General databases, on the other hand, can store data in many different kinds of formats equally well and come with pre-built notions of search. This is a Good Thing in general. 

So we'll review our use of the Orchestrate API and corresponding Node library and show how to modify our code to work with that notion of persistence instead.

So first go ahead and run

#+BEGIN_SRC sh :exports code
  npm install orchestrate
#+END_SRC

#+RESULTS:
| orchestrate@0.2.0 | node_modules/orchestrate |                             |                      |                 |           |                     |                   |                   |                  |              |                        |             |                  |
| ├──               | kew@0.2.2                |                             |                      |                 |           |                     |                   |                   |                  |              |                        |             |                  |
| ├──               | parse-link-header@0.1.0  | (xtend@2.0.6)               |                      |                 |           |                     |                   |                   |                  |              |                        |             |                  |
| └──               | request@2.27.0           | (json-stringify-safe@5.0.0, | forever-agent@0.5.2, | aws-sign@0.3.0, | qs@0.6.6, | tunnel-agent@0.3.0, | oauth-sign@0.3.0, | cookie-jar@0.3.0, | node-uuid@1.4.1, | mime@1.2.11, | http-signature@0.10.0, | hawk@1.0.0, | form-data@0.1.4) |

Then make a new Orchestrate application through the dashboard. Mine is going to be named "clarissa-tutorial", and it's reasonable to follow the convention when naming yours, although you can name it anything you want up-to-and-including "a-cat-named-princess-ozma-fuzzy-butt" because let's be honest with ourselves that is an amazing name for a cat though a bit wordy for an application name.

We'll still keep the same template file, but we need to add a new file called =config.js= in which we'll keep our api key for our Orchestrate database.

#+BEGIN_SRC js :exports code 
  module.exports = [YOUR KEY HERE]
#+END_SRC

#+BEGIN_SRC js :exports code :tangle MicroBlog-4.js
  var http = require('http');
  var url = require('url');
  var fs = require('fs');
  var hogan = require('hogan.js');
  // loading our API key from our config file
  var apiKey = require('./config');

  // loading our connection to 
  var db = require('orchestrate')(apiKey);

  var templateFile = fs.readFileSync('posts-1.html').toString();
  var template = hogan.compile(templateFile);

  var posts = [];

  function extractValue(str){
      // this function is for splitting the data returned by a form
      // we need to split it across the = sign
      var index = str.indexOf('=');
      return str.slice(index+1);
  }

  http.createServer(function (req,res) {
      var method = req.method;
      var urlObj = url.parse(req.url,true);
      var urlPath = urlObj.path.slice(1).split('/')[0];
      
      if(method === "GET" && urlPath===""){
          db.list('posts').then(function (results) {
              var prePosts = results.body.results;
              posts = prePosts.map(function (p) {
                  return p.value.text;
              });
              var html = template.render({posts : posts});
              res.writeHead(200,{"Content-Type" : "text/html"});
              res.end(html);
          }).fail(function (err) {
              console.log(err);
              res.end(err);
          });
      }
      else if (method === "POST" && urlPath ==="addpost") {
          var tempPost = "";
          req.on("data", function (chunk) {
              tempPost = tempPost + chunk.toString();
          });
          req.on("end", function () {
              var html ='<a href="/">Go Back</a>';
              var newKey = posts.length;
              db.put('posts',newKey.toString(), 
                     { "text" : extractValue(tempPost)}).then( function (r) {
                         res.writeHead(200,{"Content-Type" : "text/html"});
                         res.end(html);
                     });
          });
      }
  }).listen(3000, function () {
      console.log("Listening on port 3000\n")
  });

#+END_SRC

Before we move on to talking about using Express to make simpler servers let's talk about how we've had to change our code to work with Orchestrate. First off, we need to require Orchestrate with ~require('orchestrate')~ but then, strangely, we do this thing where we /apply/ it to our API key immediately? I know this has confused some people so let's just explain with the following code sample

#+BEGIN_SRC js :exports code :results output
  function myPlus(a){
      return function (b) {
          return a+b;
      };
  }

  console.log(myPlus(1)(1)); //should equal 2
#+END_SRC

In other words, if we have functions that return other functions then we can pass the arguments one at a time in order to compute the final result. In our example, we can write a version of ~+~ that takes its two arguments one at a time. In formal terms, this is called "currying" named after Haskell Curry, but that's a digression for another time. So when we have the line ~require('orchestrate')(apiKey)~ it means that the ~module.exports~ that orchestrate returns is a /function/ that eats the API key and gives us the connection to the database.

Rather than using our ~readData~ and ~writeData~ functions that we wrote ourselves for our file based persistence we instead use the built in Orchestrate functions ~.list~ and ~.put~. These functions have fairly simple signatures. ~.list~ takes the name of a collection and then, well actually that's the key word now isn't it? It's not terribly useful at all unless we use the promise ~.then~ in order to set an action to take once the data within the collection has been retrieved. In this case, ~.then~ takes a callback which takes the result of the retrieval as its only argument. Orchestrate data is a little more complicated than what our previous data looked like. So when we retrieve that data we need to acces the ~.results~ property to get back an /array/ of Orchestrate data objects, and then we need to extract the /text/ property out of the /value/ object and to do this for each element of the array we use the ~.map~ method that every array comes with.

Similarly when we write the data to the database we need to provide the collection, the key, and the data in a json format object. In this case we just include a single field, ~text~, to the json object. 
*** An Aside: package.json
    As we add more complicated functionality to our servers we'll need to add libraries, this means that we'll have our ~package.json~ file that we need to run in our directory before we actually try running our files. The package.json file we'll be using has the following contents

#+BEGIN_SRC json :exports code :tangle package.json
  {
      "name" : "tutorial",
      "description" : "our fair tutorial",
      "dependencies" : {
          "express" : "*",
          "consolidate" : "*",
          "morgan" : "*",
          "orchestrate" : "*",
          "body-parser" : "*",
          "hogan.js" : "*"
      }
  }
#+END_SRC

Now we're using a little bit of bad form here because really we should specify version numbers and not just say "*", which means use the latest version of the dependency, and in general you should pick particular versions or limit the versions somehow. 

Now that we have our package file go ahead and run the following command

#+BEGIN_SRC sh :exports code
  npm install
#+END_SRC

#+RESULTS:
| consolidate@0.10.0 | node_modules/consolidate |                    |                   |                 |
|                    |                          |                    |                   |                 |
| q@1.0.1            | node_modules/q           |                    |                   |                 |
|                    |                          |                    |                   |                 |
| morgan@1.1.1       | node_modules/morgan      |                    |                   |                 |
| └──                | bytes@1.0.0              |                    |                   |                 |
|                    |                          |                    |                   |                 |
| body-parser@1.4.3  | node_modules/body-parser |                    |                   |                 |
| ├──                | qs@0.6.6                 |                    |                   |                 |
| ├──                | media-typer@0.2.0        |                    |                   |                 |
| ├──                | bytes@1.0.0              |                    |                   |                 |
| ├──                | raw-body@1.2.2           |                    |                   |                 |
| ├──                | depd@0.3.0               |                    |                   |                 |
| ├──                | iconv-lite@0.4.3         |                    |                   |                 |
| └──                | type-is@1.3.1            | (mime-types@1.0.0) |                   |                 |
|                    |                          |                    |                   |                 |
| express@4.6.1      | node_modules/express     |                    |                   |                 |
| ├──                | merge-descriptors@0.0.2  |                    |                   |                 |
| ├──                | utils-merge@1.0.0        |                    |                   |                 |
| ├──                | parseurl@1.1.3           |                    |                   |                 |
| ├──                | cookie@0.1.2             |                    |                   |                 |
| ├──                | escape-html@1.0.1        |                    |                   |                 |
| ├──                | finalhandler@0.0.3       |                    |                   |                 |
| ├──                | cookie-signature@1.0.4   |                    |                   |                 |
| ├──                | fresh@0.2.2              |                    |                   |                 |
| ├──                | range-parser@1.0.0       |                    |                   |                 |
| ├──                | vary@0.1.0               |                    |                   |                 |
| ├──                | qs@0.6.6                 |                    |                   |                 |
| ├──                | media-typer@0.2.0        |                    |                   |                 |
| ├──                | methods@1.1.0            |                    |                   |                 |
| ├──                | serve-static@1.3.2       |                    |                   |                 |
| ├──                | buffer-crc32@0.2.3       |                    |                   |                 |
| ├──                | depd@0.3.0               |                    |                   |                 |
| ├──                | path-to-regexp@0.1.3     |                    |                   |                 |
| ├──                | debug@1.0.3              | (ms@0.6.2)         |                   |                 |
| ├──                | proxy-addr@1.0.1         | (ipaddr.js@0.1.2)  |                   |                 |
| ├──                | type-is@1.3.2            | (mime-types@1.0.1) |                   |                 |
| ├──                | accepts@1.0.7            | (negotiator@0.4.7, | mime-types@1.0.1) |                 |
| └──                | send@0.6.0               | (ms@0.6.2,         | mime@1.2.11,      | finished@1.2.2) |

